{
"_meta": 
{
    "sources": 
    [
        {
            "json": "Starlight: Conditions",
            "abbreviation": "S: Conditions",
            "full": "Starlight: Conditions",
	    "color": "dac4ff",
            "authors": [
                "Starlight"
            ],
            "convertedBy": [
                "Starlight"
            ],
            "version": "1.0",
            "url": "https://github.com/TeraMika/starlight-homebrew",
            "targetSchema": "1.0"
        }
    ],
    "dateAdded": 0,
    "dateLastModified": 0
},

"condition": 
[
    {
        "name": "Dazed",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A dazed creature can take an action or a bonus action, but not both. Their movement speed is {@condition Sluggish|S: Conditions}.",
                "If a creature becomes dazed during their turn, their turn ends."
            ]
            }
        ]
    },
    {
        "name": "Disoriented",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A disoriented creature has its movement {@condition Hampered|S: Conditions} and disadvantage on Wisdom and Intelligence ability checks and saving throws.",
                "The creature can make only one attack with an action or bonus action, and cannot cast levelled spells."
            ]
            }
        ]
    },
    {
        "name": "Shocked",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
            "type": "list",
            "items":
            [
                "A shocked creature is {@condition incapacitated} and {@condition halted|S: Conditions}.",
                "The creature automatically fails Strength and Dexterity saving throws.",
                "Attack rolls against the creature have advantage.",
                "The condition can be ended on a creature if another creature spends an action or bonus action to help them recover."
            ]
            }
        ]
    },
    {
        "name": "Weakened",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A weakened creature deals half damage with weapon attacks.",
                "Other creatures have advantage on any saving throw they make against a weakened creature or their effects."
            ]
            }
        ]
    },
    {
        "name": "Off-balance",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "Attacks against an off-balance creature have advantage, and its attacks have disadvantage.",
                "The creature has disadvantage on any checks or saving throws it makes to avoid being forcibly moved or falling prone.",
                "The condition ends when a creature takes damage, or misses an attack roll."
            ]
            }
        ]
    },
    {
        "name": "Exposed",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "Successful attacks against an exposed creature count as a critical hit."
            ]
            }
        ]
    },
    {
        "name": "Marked",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "Attack rolls against a marked creature have advantage, unless that creature takes the dodge action, which negates this effect and provides disadvantage as normal.",
                "Marked can be applied multiple times, denoted as 'Marked (X)', and each marked effect ends after one attack. For example, 'Marked (3)' would last for 3 attacks."
            ]
            }
        ]
    },
    {
        "name": "Numb",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A creature can be Numb multiple times.",
                "A numb creature loses 5 feet of movement and 1 Charisma for each time it is Numb.",
                "If a creature has 0 movement speed or charisma as a result of the numb effect, that creature loses all numb affecting them and becomes {@condition listless|S: Conditions}.",
                "If a numb creature does not receive more numb or take damage since its previous turn, and cannot see the source of its numb, it loses one instance of numb at the end of its turn."
            ]
            }
        ]
    },
    {
        "name": "Listless",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A listless creature falls {@condition prone}, becomes {@condition incapacitated} and is {@condition halted|S: Conditions}.",
                "The condition ends if the listless creature expends inspiration, they take more than 20 damage in one attack, or an ally spends an action to help them recover.",
                "When this condition ends, the creature gains two {@condition numb|S: Conditions} effects. The first turn after this ends, the creature can stand from prone at the cost of only 5 feet of movement, as they quickly snap to their senses."
            ]
            }
        ]
    },
    {
        "name": "Silenced",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
            "type": "list",
            "items":
            [
                "A silenced creature cannot speak, or cast spells requiring verbal components.",
                "The creature is immune to thunder damage."
            ]
            }
        ]
    },
    {
        "name": "Bleeding",
        "source": "S: Conditions",
        "page": 0,
        "entries": 
        [
            {
            "type": "list",
            "items": 
            [
                "A creature can be bleeding multiple times.",
                "A bleeding creature takes 3 necrotic damage at the start of each of its turns for each instance of bleed it has. It then loses one instance of bleeding.",
                "The creature also has disadvantage on Constitution saving throws.",
                "The condition is removed by gaining hit points, but not temporary hit points."
            ]
            }
        ]
    },
    {
        "name": "Sundered",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            "The creature's armour class cannot benefit from armour or shields, but still gains any bonuses to AC that those items offer (such as a +1 shield). If the armour would limit the creature's Dexterity modifier bonus to armour class (such as Half-Plate or Plate armour) or impose disadvantage on Stealth (Dexterity) checks, it still does."
        ]
    },
    {
        "name": "Staggered",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            "The creature's armour class cannot be increased by its Dexterity modifier."
        ]
    },
    {
        "name": "Burning",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
                "type": "list",
                "items":
                [
                    "The creature takes 3 fire damage at the start of each of its turns.",
                    "The creature must spend an action to interact with objects or features of the environment (such as drawing a weapon or opening doors).",
                    "A creature can also use an action to attempt a DC 10 Medicine check to stop the burning.",
                    "A creature that is immune to fire damage is immune to this condition. A creature resistant to fire damage has advantage on any saving throws against it."
                ]
            }
        ]
    },
    {
        "name": "Hampered",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
                "type": "list",
                "items":
                [
                    "A hampered creature's movement speed is reduced by 10 feet. This applies to all of its movement speeds unless specified otherwise.",
                    "This can be applied multiple times, combining the speed reduction, but not from the same source."
                ]
            }
        ]
    },
    {
        "name": "Slowed",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            "A slowed creature's movement speed is reduced by half."
        ]
    },
    {
        "name": "Sluggish",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            "A sluggish creature's movement speed is 10 feet."
        ]
    },
    {
        "name": "Halted",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            "A halted creature's movement speed is 0 feet."
        ]
    },
    {
        "name": "Dying",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
                "type": "list",
                "items":
                [
                    "If you start your turn while Dying, you roll a death saving throw as per the PHB rules. Regaining any hit points ends this condition on you. Being stabilised via a DC 10 Wisdom (Medicine) check prevents only the death saving throw rolls.",
                    "You are prone and cannot get up.",
                    "On your turn, you can move, or take an action or a bonus action. Taking an action gives two levels of exhaustion, bonus actions and reactions give one."
                ]
            }
        ]
    },
    {
        "name": "Withering",
        "source": "S: Conditions",
        "page": 0,
        "entries":
        [
            {
                "type": "list",
                "items":
                [
                    "A Withering creature cannot regain hit points by any means and its movement is {@condition Hampered|S: Conditions}.",
                    "The creature takes 2d8 necrotic damage as it receives the condition, and a further 1 necrotic damage each hour.",
                    "The condition can be removed via Greater Restoration or a more powerful healing spell (Such as {@spell Heal|phb}, {@spell Regenerate|phb}, or {@spell Power Word Heal|phb}). Alternatively, {@spell Lesser Restoration|phb} can be used if the caster succeeds a DC 15 ability check with their spellcasting ability (expending the slot regardless).",
                    "Typically, this condition is reserved for Darkiron, a material found in (but not native to) Neverwhere. At the DM's discretion, other effects may apply this condition, but with easier removal and/or greater damage."
                ]
            }
        ]
    }
]
}
