{
    "_meta": {
        "sources": [
            {
                "json": "SToD: Species",
                "abbreviation": "SToD: Species",
                "color": "737373",
                "full": "Shifting Tides of Delamir: Species",
                "authors": [
                    "Mika Rae"
                ],
                "version": "1.0",
                "url": "https://github.com/TeraMika/starlight-homebrew",
                "targetSchema": "1.0"
            }
        ]
    },
    "race": [
        {
            "name": "Riftborn Lacertal",
            "source": "SToD: Species",
            "lineage": "VRGR",
            "skillProficiencies": 
            [
                {
                    "perception": true
                }
            ],
            "creatureTypes": 
            [
                "humanoid"
            ],
            "size": 
            [
                "M",
                "S"
            ],
            "speed": 
            {
                "walk": 30,
                "fly": 30
            },
            "additionalSpells": 
            [
                {
                    "ability": 
                    {
                        "choose": 
                        [
                            "int",
                            "wis",
                            "cha"
                        ]
                    },
                    "known": 
                    {
                        "1": 
                        {
                            "_": 
                            [
                                {
                                    "choose": "level=0|group=primal"
                                }
                            ]
                        }
                    }
                }
            ],
            "fluff": {
                "entries":
                [
                    {
                        "type": "entries",
                        "name": "Origin",
                        "entries":
                        [
                            "The Lacertal are a simple folk. Living peaceful lives in another plane. When the rifts appeared, this changed dramatically, and while they steer clear sometimes fate determine that one makes their way in, willfully or not.",
                            "Few survive the journey: going up is much harder than going down. Those that do rarely remember anything, especially if they are young, and none so far have made it to civilisation meaningfully. The lacertal learned to steer clear long ago, and even with only primitive communication warnings of the rift are passed through generations.",
                            "Of course, this doesn't stop any particularly foolhardy, sneaky, and curious lacertal from entering anyway. However they end up in the rift, it is likely to change them in ways that make them hard to recognise back home."
                        ]
                    }
                ]
            },
            "entries": 
            [
                {
                    "type": "entries",
                    "name": "Winged Form",
                    "entries": 
                    [
                        "You have a flying speed equal to your movement speed."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Malformed Wings",
                    "entries": 
                    [
                        "You fall at the end of your turn if you are airborne and the only thing holding you aloft is your flying speed."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Rift Magic Exposure",
                    "page": 8,
                    "entries": 
                    [
                        "Your exposure to the wild magics of Delamir has given you some innate spellcasting, connected to the elements. You know one cantrip from the {@filter druid spell list|spells|level=0|class=Druid}. Whenever you finish a Long Rest, you can replace that spell with a different one from the Druid Spell list.",
                        "Intelligence, Wisdom or Charisma is your spellcasting ability for any spell you cast with this trait (choose when you select this species)."
                    ]
                },
                {
                    "type": "entries",
                    "name": "Keen Senses",
                    "page": 8,
                    "entries": 
                    [
                        "You have Proficiency in the {@skill Perception} Skill."
                    ]
                }
            ]
        },
        {
        "name": "Tempestborn",
        "source": "SToD: Species",
        "lineage": "VRGR",
        "size": 
        [
            "S",
            "M"
        ],
        "speed": 30,
        "darkvision": 60,
        "resist": 
        [
            "lightning",
            "thunder"
        ],
        "additionalSpells": 
        [
            {
                "ability": 
                {
                    "choose": 
                    [
                        "int",
                        "wis",
                        "cha"
                    ]
                },
                "known": 
                {
                    "1": 
                    [
                        "light#c"
                    ]
                }
            }
        ],
        "entries": [
            {
                "type": "entries",
                "name": "Tempestborn Resistance",
                "entries": 
                [
                    "You have resistance to lightning damage and thunder damage."
                ]
            },
            {
                "type": "entries",
                "name": "Darkvision",
                "entries": 
                [
                    "You can see in dim light within 60 feet of you as if it were bright light and in darkness as if it were dim light. You discern colors in that darkness only as shades of gray."
                ]
            },
            {
                "type": "entries",
                "name": "Healing Hands",
                "entries": 
                [
                    "As an action, you can touch a creature and roll a number of d4s equal to your proficiency bonus. The creature regains a number of hit points equal to the total rolled. Once you use this trait, you can't use it again until you finish a long rest."
                ]
            },
            {
                "type": "entries",
                "name": "Light Bearer",
                "entries": 
                [
                    "You know the {@spell light} cantrip. Intelligence, Wisdom or Charisma is your spellcasting ability for this cantrip (choose when you select this species)."
                ]
            },
            {
                "type": "entries",
                "name": "Fulgur's Fury",
                "entries": 
                [
                    "When you reach 3rd level, you can use a bonus action to unleash the divine lightning within yourself, causing arcs of lightning to emenate from you. Your transformation lasts for 1 minute or until you end it as a bonus action.",
                    "During your transformation, you shed bright light in a 10-foot radius and dim light for an additional 10 feet, and at the end of each of your turns, each creature within 10 feet of you takes lightning damage equal to your proficiency bonus. Until the transformation ends, once on each of your turns, you can deal extra lightning damage to one target when you deal damage to it with an attack or a spell. The extra damage equals your proficiency bonus.",
                    "Once you use this trait, you can't use it again until you finish a long rest."
                ]
            }
        ],
        "hasFluff": true,
        "languageProficiencies": 
        [
            {
                "common": true,
                "anyStandard": 1
            }
        ]
        },
        {
        "name": "Elf (Profane)",
        "source": "SToD: Species",
        "lineage": "VRGR",
        "size":
        [
            "S",
            "M"
        ],
        "speed": 30,
        "darkvision": 60,
        "resist":
        [
            "fire",
            "poison"
        ],
        "additionalSpells": 
        [
            {
                "innate": {
                    "3": {
                        "daily": {
                            "1": [
                                "hellish rebuke#2"
                            ]
                        }
                    }
                },
                "ability":                     
                {
                    "choose": 
                    [
                        "int", "wis", "cha"
                    ]
                },
                "known": {
                    "1": [
                        "thaumaturgy#c"
                    ]
                }
            }
        ],
        "fluff": {
            "entries":
            [
                {
                    "type": "entries",
                    "name": "Origin",
                    "entries":
                    [
                        "Profane Elves originate from a dark ritual, giving a soul from the abyss a physical form. This grants them the ability to remain in the realm without issue. Without it, the soul cannot maintain its presence in the True Material.",
                        "While they take the physical shape and build of an elf, their lifespan is essentially random, and there is no process of maturing or aging otherwise. Typically, a profane elf would die in combat, their body would turn to ashes and their soul return to the lower planes.",
                        "Unlike other Sun'Dorai methods of taking form in the True Material plane, profane elves do not possess an alternate form. Once this body has reached its limit, it breaks. Healing is a slow process with this body, as parts may turn to ash when they are removed."
                    ]
                }
            ]
        },
        "entries": 
        [
            {
                "name": "Age",
                "type": "entries",
                "entries": [
                    "You are created mature, and could in theory live indefinitely, provided your body does not take damage too severe. No upper age limit is known for a Profane Elf, but no magic lasts forever."
                ]
            },
            {
                "type": "entries",
                "name": "Size",
                "entries": [
                    "Elves range from under 5 to over 6 feet tall and have slender builds, which you have inherited as a part of your creation. Your size is Medium."
                ]
            },
            {
                "type": "entries",
                "name": "Darkvision",
                "entries":
                [
                    "Their abyssal heritage grants Profane Elves superior vision in dark and dim conditions. You can see in dim light within 60 feet of you as if it were bright light, and in darkness as if it were dim light. You can't discern color in darkness, only shades of gray."
                ]
            },
            {
                "type": "entries",
                "name": "Abyssal Heritage",
                "entries": 
                [
                    "The ritual that brought you to this plane confers some of your heritage's resilience and knowledge. You have resistance to fire and poison damage. Additionally, you can speak, read, and write Abyssal."
                ]
            },
            {
                "type": "entries",
                "name": "Abyssal Magics",
                "entries":
                [
                    "You know the {@spell thaumaturgy} cantrip. Once you reach 3rd level, you can cast the {@spell hellish rebuke} spell as a 2nd-level spell with this trait; you regain the ability to cast it when you finish a long rest."   
                ]
            },
            {
                "type": "entries",
                "name": "Keen Senses",
                "entries":
                [
                    "You have profiency in the {@skill Perception} skill."
                ]
            },
            {
                "name": "Trance",
                "entries": [
                    "Elves don't need to sleep, and the ritual that created you has granted you the same ability. Instead, they meditate deeply, remaining semiconscious, for 4 hours a day. (The Common word for such meditation is \"trance.\") While meditating, you have visions of the Abyss, instead of dreams. After resting in this way, you gain the same benefit that a human does from 8 hours of sleep.",
                    "{@note If you meditate during a long rest, you finish the rest after only 4 hours. You otherwise obey all the rules for a long rest; only the duration is changed.}"
                ],
                "type": "entries"
            }
        ],
        "hasFluff": true,
        "hasFluffImages": true,
        "languageProficiencies": 
        [
            {
                "common": true,
                "abyssal": true,
                "anyStandard": 1
            }
        ]
    }
    ]
}